Revit 2027 API
SpecTypeId.CableTraySize Property
 Cable Tray Size, in discipline Electrical.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId CableTraySize { get; }
Public Shared ReadOnly Property CableTraySize As ForgeTypeId
	Get
public:
static property ForgeTypeId^ CableTraySize {
	ForgeTypeId^ get ();
}
static member CableTraySize : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace